package com.nosetr.basic;

/**
 *
 * @author nosetr
 */
public class Main {

	public static void main(String[] args) {
//	  Создайте строку как литерал: str1 = “Java”
//	  Создайте строку как литерал: str2 = “Java”
//	  Создайте строку как Объект: str 3 = new (“Java”)
//	  Создайте строку как Объект: str 4 = new (“Java”)
//	  Сравните строки 1 и 2 используя == 
//	  Сравните строки 1 и 2 используя equals
//	  Сравните строки 3 и 4 используя == 
//	  Сравните строки 3 и 4 используя equals
//	  Сравните строки 1 и 3 используя == 
//	  Сравните строки 1 и 3 используя equals
//	  Проанализируйте результат

//		String str1 = "Java";
//		String str2 = "Java";
//		String str3 = new String("Java");
//		String str4 = new String("Java");
//		System.out.println(str1 == str2);
//		
//		StringBuilder sBuilder = new StringBuilder();
//		sBuilder.append("Hello world");
//		sBuilder.append(" ");
//		sBuilder.append("java");
//		sBuilder.replace(5, 10, "!");
//		
//		String string = sBuilder.toString()
		
		/*
		Создайте StringBuilder объекты используя все предоставленные конструкторы
		Используя метод append добавьте к объекту, который создан при помощи конструктора без параметров, строку “StartaUniversity”
		Распечатайте все объекты на консоле
		Примените метод reverse() к любому созданному объекту
		Распечатайте объект на консоле
		*/
		
	}

//	static String charSet(String in, char symbol, int pos) {
//		String out = "";
//
//		// String out = in.substring(0, pos);
//		for (int i = 0; i < pos; i++) {
//			out += in.charAt(i);
//
//			out += symbol;
//
//			// out += in.substring(pos + 1);
//			for (int i = 0; i < in.length(); i++) {
//				System.out.println();
//			}
//		}
//		
//		return out;
//	}
}
